#1
#შემოტანილი რიცხვის დაპრინტვა შეწყვიტეთ როცა ის 5-ს გაუტოლდება.

num=1
while num<5:
    print(num)
    num+=1

#2
#იქამდე შეადარეთ რიცხვი 1 10-ს სანამ 7-ს არ მიახწევს
i = 1
while i < 10:
  print(i)
  if i == 7:
    break
  i += 1

#3
#შემოტანილი რიცხვი იქამდე შეადარეთ 20-ს სანამ ის მაზნე ნაკლები აღარ იქნება
i=1
while i < 20:
  print(i)
  i += 1
else:
  print("i is no longer less than 20")

#4 
#მომხმარებელს შემოატანინეთ რიცხვი და იქამდე შეადარეთ ის 0-ს სანამ ის მისი ტოლი არ იქნება
user_num=int(input("enter num: "))
i=0
while i<user_num:
  print(i)
  i+=1

#5
#მომხმარებელს შემოატანინეთ რიცხვიდა იქამდე შეადარეთ 100-ს სანამ ის მასზე მეტი არ იქნება
num=int(input("enter num:"))
while num<100:
  print(i)
  if num>100:
    break